# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'moreutils'
brew 'pkg-config'
brew 'svn' # needed to install fonts

# Development
brew 'bat'
brew 'exa'
brew 'fzf'
brew 'glances' # better `top`
brew 'imagemagick'
brew 'jq'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'pure'
brew 'redis'
brew 'ripgrep'
brew 'shellcheck'
brew 'yarn'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'BetterSnapTool', id: 417375580
mas 'CARROT Weather', id: 993487541
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'Xcode', id: 497799835